from labs_5.equations import *


xo = float(input("Введите начальное приближение: "))
n = int(input("Введите максимальное число итераций: "))
s = float(input("Введите точность: "))

print("Уравнения вида m * np.exp(-1 * (k * x)) - x")
params_one = float(input("Введите первый параметр m для уравнения: "))
params_two = float(input("Введите второй параметр k для уравнения: "))

a = float(input("Введите начальный интвервал для отделения корней"))
b = float(input("Введите конечный интервал для отделения корней"))


